
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7367561223)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * google_compute_instance_group_manager.minecraft_group
* Replace
  * google_compute_instance_template.minecraft_template


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_instance_group_manager.minecraft_group will be updated in-place
  ~ resource "google_compute_instance_group_manager" "minecraft_group" {
        id                             = "projects/bakatare-minecraft/zones/us-central1-a/instanceGroupManagers/minecraft-group"
        name                           = "minecraft-group"
        # (12 unchanged attributes hidden)

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229214525547200000001" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance_template.minecraft_template must be replaced
+/- resource "google_compute_instance_template" "minecraft_template" {
      ~ effective_labels        = {} -> (known after apply)
      ~ id                      = "projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229214525547200000001" -> (known after apply)
      ~ metadata                = { # forces replacement
          ~ "shutdown-script" = <<-EOT
                #!/bin/bash
              - cd ~/bakatare-minna/docker && docker compose exec mc rcon-cli 王道注意
              + cd ~/bakatare-minna/docker && docker compose exec mc rcon-cli say 王道注意
              + cd ~/bakatare-minna/docker && docker compose exec mc rcon-cli save-all
            EOT
            # (1 unchanged element hidden)
        }
      ~ metadata_fingerprint    = "3EqVqbrep_M=" -> (known after apply)
      ~ name                    = "minecraft-template-20231229214525547200000001" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229214525547200000001" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229214525547200000001?uniqueId=1311528950566126361" -> (known after apply)
        tags                    = [
            "minecraft",
        ]
      + tags_fingerprint        = (known after apply)
      ~ terraform_labels        = {} -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          - labels            = {} -> null
          ~ mode              = "READ_WRITE" -> (known after apply)
          ~ provisioned_iops  = 0 -> (known after apply)
          - resource_policies = [] -> null
          ~ type              = "PERSISTENT" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/networks/minecraft" -> "minecraft"
          - queue_count                 = 0 -> null
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          ~ access_config {
              ~ network_tier           = "PREMIUM" -> (known after apply)
              + public_ptr_domain_name = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
          + provisioning_model  = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":53,"Program":"tfcmt","SHA1":"42f188dbbc7edff9ba0f41f3184509978f9277c7","Target":"terraform","Vars":{},"WorkflowName":"test"} -->